[
    {
        "id": 1,
        "name": "Washington D.C. Temple",
        "address": "9900 Stoneybrook Dr\nKensington MD 20895-3199\nUnited States",
        "phone": "(+1) 301-588-0650",
        "schedule": "Appointments for living ordinances can be made by calling 301-588-0650. Reservations for proxy ordinances can be made using the online appointment system.",
        "appointment": "https://www.churchofjesuschrist.org/temples/schedule/appointment?lang=eng",
        "imageurl": "./images/temples/washington/",
        "services": {
            "clothing-rental": true,
            "cafeteria": false,
            "housing": false,
            "distribution-center": true
        },
        "history": [
            {
                "text": "The Washington D.C. Temple was the first temple built in the Eastern United States (and in Maryland)."
            },
            {
                "text": "The Washington D.C. Temple was the first temple to feature six spires since the construction of the Salt Lake Temple, which inspired the design."
            },
            {
                "text": "Soaring to a height of 288 feet, the Washington D.C. Temple is the tallest temple in the Church."
            },
            {
                "text": "The Washington D.C. Temple is one of only four temples with six instruction rooms and the only one outside of Utah. (The other three temples are the Ogden Utah Temple, the Provo Utah Temple, and the Jordan River Utah Temple.)"
            },
            {
                "text": "The Washington D.C. Temple was originally named the Washington Temple."
            },
            {
                "text": "The Washington D.C. Temple is one of only five temples featuring an angel Moroni statue holding the gold plates. (The other four temples are the Los Angeles California Temple, the Jordan River Utah Temple, the Seattle Washington Temple, and the Mexico City Mexico Temple.)"
            },
            {
                "text": "Avard T. Fairbanks was one of nine sculptors who presented models for the Washington D.C. Temple angel Moroni. The 18-foot tall statue was cast in bronze, then covered with gold leaf. Moroni holds the gold plates in his left hand and a trumpet in his right. Fifteen-foot replicas of the statue were used on the Jordan River Utah Temple, Seattle Washington Temple, and México City México Temple."
            },
            {
                "text": "Under the general direction of Church Architect Emil B. Fetzer, four architects collaborated on the design for the Washington D.C. Temple: Fred L. Markham, Henry P. Fetzer, Harold K. Beecher, and Keith W. Wilcox. Of the many design concepts submitted to the First Presidency, Brother Wilcox's design was selected."
            },
            {
                "text": "The exterior of the Washington D.C. Temple is faced in white Alabama marble, symbolizing purity and enlightenment, which is shaved to 5/8 of an inch in some areas to allow a soft glow of sunlight to pass into the interior during the day."
            },
            {
                "text": "Beautiful stained glass runs the length of the end towers of the Washington D.C. Temple with rich, vibrant reds and oranges giving way to more translucent blues and violets and finally white. The windows represent the unbroken progress toward the divine available in the gospel and the purity that enters one's life as he rises above earthly cares and reaches heavenward."
            },
            {
                "text": "Eight bronze medallions—symbolizing creation, mortality, and the degrees of glory—are featured on both the gates and the doors of the Washington D.C. Temple. Sculptor Franz Johansen, a member of the Church, depicted the Big Dipper and North Star, the earth, the planets, the moon, the stars, the sun, concentric circles representing eternity, and seven concentric pentagons representing the seven dispensations."
            },
            {
                "text": "The main lobby of the Washington D.C. Temple features a striking 30-foot-long mural depicting the Second Coming of Jesus Christ. An image of the temple itself is incorporated into the mural."
            },
            {
                "text": "The seven floors of the Washington D.C. Temple represent the six days of creation and the day of rest."
            },
            {
                "text": "Following the completion ceremonies for the Washington D.C. Temple, in which a time capsule was placed in the northeast corner of the building, President Spencer W. Kimball conducted the largest press conference in the Church's history."
            },
            {
                "text": "The highly successful public open house of the Washington D.C. Temple was attended by 758,328 guests including special guest Betty Ford—wife of then-U.S. President Gerald Ford. These tours resulted in over 75,000 missionary referrals."
            },
            {
                "text": "General authorities spoke at each of the ten dedicatory sessions for the Washington D.C. Temple. All of the Church's general authorities were in attendance except for two: Elder Alma Sonne, Assistant to the Council of the Twelve, and President Milton R. Hunter, First Council of Seventy."
            },
            {
                "text": "For a time, the Washington D.C. Temple offered overnight endowment sessions from Friday through Saturday to accommodate the many members who came on the weekend."
            }
        ]
    },
    {
        "id": 2,
        "name": "Philadelphia Pennsylvania Temple",
        "address": "1739 Vine St\nPhiladelphia PA 19103\nUnited States",
        "phone": "(+1) 215-398-3040",
        "schedule": "Appointments for proxy ordinances are encouraged. Patrons without appointments are also welcome, but may be asked to wait for an opportunity to participate. Click the Appointments button below to schedule or modify a proxy appointment.",
        "appointment": "https://www.churchofjesuschrist.org/temples/schedule/appointment?lang=eng",
        "imageurl": "./images/temples/philadelphia/",
        "services": {
            "clothing-rental": true,
            "cafeteria": false,
            "housing": false,
            "distribution-center": true
        },
        "history": [
            {
                "title": "Background",
                "text": "Several significant events in Church history took place in Pennsylvania including much of the translation of the Book of Mormon and the restoration of priesthood authority. The Church was first established in Pennsylvania in 1839, growing to 450 members by October 1840. Membership fell following the migration of the Saints to Salt Lake but grew again as Mormon European emigrants arrived. Eventually the first stake was organized in 1960 with 1,100 members located in congregations in southeastern Pennsylvania, New Jersey, Delaware, and Maryland."
            },
            {
                "title": "Announcement",
                "text": "On October 4, 2008, President Thomas S. Monson announced that the City of Brotherly Love would be home to Pennsylvania's first temple during his opening remarks of the 178th Semiannual General Conference. The temple was announced jointly with four other temples including the Calgary Alberta Temple, Córdoba Argentina Temple, Kansas City Missouri Temple, and Rome Italy Temple. There were nearly 48,000 members in Pennsylvania."
            },
            {
                "title": "Temple Site",
                "text": "On November 19, 2009, the location of the Philadelphia Pennsylvania Temple was announced for Center City Philadelphia on the site of a parking lot at the northeast corner of Vine Street and North 18th Street across from the Cathedral Basilica of Saints Peter and Paul and diagonal to beautiful Logan Square."
            },
            {
                "text": "The temple was originally to be a multipurpose building constructed at the northeast corner of North Broad Street and Noble Street, but contamination problems on the site—discovered after the purchase—prohibited the Church from using the entire parcel as planned. Church officials began combing the city for another suitable site and by May 2009, they had contacted Stephen Klein dba Logan Place Associates about his Vine Street property. On August 10, 2009, Klein signed an agreement to sell the property to the Church for an undisclosed sum. Late in 2010, the Church became the owners of the Vine Street property when sale of the parcel was finalized."
            },
            {
                "title": "Rendering",
                "text": "On June 24, 2011, Elder Jay E. Jensen of the Presidency of the Seventy unveiled the official rendering of the Philadelphia Pennsylvania Temple for the first time at a VIP event held prior to a Tabernacle Choir at Temple Square concert in Philadelphia's Mann Center. The granite-clad building was designed to complement the neoclassical architecture of the neighboring buildings and throughout historic Philadelphia where the United States was founded in 1776. The steeples, for example, echo the clock tower on Independence Hall, and the period furnishings create an air of historic Philadelphia."
            },
            {
                "title": "Groundbreaking",
                "text": "President Henry B. Eyring, first counselor in the First Presidency, presided at the groundbreaking ceremony for the Philadelphia Pennsylvania Temple on Saturday, September 17, 2011, on the 224th anniversary of the signing of the Constitution of the United States at Philadelphia's Independence Hall. Church leaders were joined by Mayor Michael Nutter and other local community and religious dignitaries. \"The work done in these sacred buildings becomes the crowning element of our religious worship\" said President Eyring. \"For Latter-day Saints, no building is more sacred than a dedicated temple of God.\""
            },
            {
                "title": "Open House",
                "text": "A month-long open house was held for the Philadelphia Pennsylvania Temple from August 10 through September 9, 2016. A total of 140,000 guests attended including including 4,000 invited civic, religious, and government leaders."
            },
            {
                "title": "Cultural Celebration",
                "text": "On the evening before the dedication of the Philadelphia Pennsylvania Temple, hundreds of Latter-day Saint youth participated in a cultural celebration at Liacouras Center at Temple University to mark the completion of the temple. Through song and dance, the performers honored the state's heritage and the history of the Church in Pennsylvania. President Henry B. Eyring told the youth, \"This day is historic in your lives. You will always remember the feeling of celebration and faith as you prepared for this performance tonight. You will tell your children and perhaps your grandchildren.\""
            },
            {
                "title": "Dedication",
                "text": "President Henry B. Eyring, first counselor in the First Presidency, dedicated the Philadelphia Pennsylvania Temple on Sunday, September 18, 2016, in the 240th anniversary year of the signing of the Declaration of Independence at the Pennsylvania State House, now known as Independence Hall. At the cornerstone ceremony preceding the dedication, President Eyring shared that he was born in New Jersey and baptized in Philadelphia. \"So to me, this is especially significant,\" he said, \"that the Lord would have granted this wonderful house to you wonderful people in this part of Zion.\""
            },
            {
                "text": "He prayed for the country in his dedicatory prayer saying, \"We are profoundly grateful for the Constitution of the United States and for the Bill of Rights. These are the guarantors of our independence and our liberty. We pray for this nation of which we are part. Preserve the freedom of the people now and for generations to come. May these blessings rest upon its citizens without restraint or hindrance of any kind.\""
            }
        ]
    },
    {
        "id": 3,
        "name": "Manhattan New York Temple",
        "address": "125 Columbus Ave, Fourth Floor\nNew York NY 10023-6514\nUnited States",
        "phone": "(+1) 917-441-8220",
        "schedule": "Appointments for proxy ordinances are encouraged. Patrons without appointments are also welcome, but may be asked to wait for an opportunity to participate. Click the Appointments button below to schedule or modify a proxy appointment.",
        "appointment": "https://www.churchofjesuschrist.org/temples/schedule/appointment?lang=eng",
        "imageurl": "./images/temples/manhattan/",
        "services": {
            "clothing-rental": true,
            "cafeteria": false,
            "housing": false,
            "distribution-center": true
        },
        "history": [
            {
                "title": "Announcement",
                "text": "In a special regional conference held in New York City on March 24, 2002, President Gordon B. Hinckley told the attending congregation that he expected a temple to be completed in New York within two years. Less than five months later, the Church's announcement of a temple to be built in Manhattan made good on that promise."
            },
            {
                "text": "In the decade preceding the temple dedication, New York area membership increased dramatically, tripling to 42,000. The rapid growth was largely attributed to immigration and aggressive proselytizing in black and Latino communities."
            },
            {
                "title": "Construction",
                "text": "In a clever adaption, the Church gutted and soundproofed the upper and lower floors of its existing multi-function Manhattan building, located across from the Lincoln Center, to secure a location for the temple in the city. The original building was completed in 1976 during a transition period for the area from rough to ritzy. This multipurpose approach to temple building had already been successfully executed in Hong Kong where real estate costs are exorbitant."
            },
            {
                "title": "Open House",
                "text": "Over 53,000 visitors from all walks of life and religious backgrounds attended the 40-minute tour during the monthlong open house. Though some mild sidewalk protesting was seen in the form of anti-Church literature, public reaction was highly positive, and media coverage was worldwide."
            },
            {
                "title": "Cultural Celebration",
                "text": "Prior to the temple dedication, a cast of 2,400 New York youth gathered at Radio City Music Hall to perform \"A Standard to the Nations,\" a two-hour jubilee performance full of song and dance, which briefly illustrated the history of the Church in New York and recognized the cultural mix there. President Gordon B. Hinckley started the custom of asking young adults to participate in cultural arts programs to celebrate temple dedications as part of his quest to make church more engaging for youth. New York youth kept the tradition going, following the example of members in Alaska, Ghana, and Denmark, who performed before their temples' dedications."
            },
            {
                "title": "Dedication",
                "text": "At the temple dedication, a time capsule was placed in the cornerstone filled with New York memorabilia including a commemorative gold-detailed white satin handkerchief patterned after a handkerchief Joseph Smith commissioned for the dedication of the Kirtland Temple. The capsule also contained a copy of the New York Times, a commemorative crystal, a set of LDS scriptures, sheet music, and more."
            },
            {
                "title": "Exterior Alterations",
                "text": "Just two-and-a-half weeks before the temple's summer dedication, Church headquarters announced that it had revised the exterior design for the temple. New cladding would be attached to portions of the building's south and west sides, and a steeple topped by the angel Moroni would be added to the roof in the fall. On Saturday, October 9, 2004, hundreds of onlookers filled the streets of Manhattan to witness the placement of the 10-foot angel Moroni upon the temple's new spire."
            }
        ]
    },
    {
        "id": 4,
        "name": "Raleigh North Carolina Temple",
        "address": "574 Bryan Dr\nApex NC 27502-4127\nUnited States",
        "phone": "(+1) 919-362-4135",
        "schedule": "Appointments for proxy ordinances are encouraged. Patrons without appointments are also welcome, but may be asked to wait for an opportunity to participate. Click the Appointments button below to schedule or modify a proxy appointment.",
        "appointment": "https://www.churchofjesuschrist.org/temples/schedule/appointment?lang=eng",
        "imageurl": "./images/temples/raleigh/",
        "services": {
            "clothing-rental": false,
            "cafeteria": false,
            "housing": false,
            "distribution-center": false
        },
        "history": [
            {
                "text": "The Raleigh North Carolina Temple was the first temple built in North Carolina."
            },
            {
                "text": "The Raleigh North Carolina Temple closed on January 7, 2018, for extensive renovation. During the remodel, crews upgraded the mechanical and electrical systems, made spaces ADA compliant, moved windows and doors to accommodate minor floor plan changes, enclosed the entrance canopy, and raised the height of the steeple by 10 feet."
            }
        ]
    }
]